auto/jmeter.log
2017-12-01 20:37:58,460 INFO o.a.j.u.JMeterUtils: Setting Locale to en
2017-12-01 20:37:58,472 INFO o.a.j.JMeter: Loading user properties from: D:\apache-jmeter-3.3\bin\user.properties
2017-12-01 20:37:58,473 INFO o.a.j.JMeter: Loading system properties from: D:\apache-jmeter-3.3\bin\system.properties
2017-12-01 20:37:58,480 INFO o.a.j.JMeter: Copyright (c) 1998-2017 The Apache Software Foundation
2017-12-01 20:37:58,480 INFO o.a.j.JMeter: Version 3.3 r1808647
2017-12-01 20:37:58,480 INFO o.a.j.JMeter: java.version=1.8.0_121
2017-12-01 20:37:58,480 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2017-12-01 20:37:58,480 INFO o.a.j.JMeter: os.name=Windows 7
2017-12-01 20:37:58,480 INFO o.a.j.JMeter: os.arch=amd64
2017-12-01 20:37:58,480 INFO o.a.j.JMeter: os.version=6.1
2017-12-01 20:37:58,480 INFO o.a.j.JMeter: file.encoding=GBK
2017-12-01 20:37:58,481 INFO o.a.j.JMeter: Max memory     =536870912
2017-12-01 20:37:58,481 INFO o.a.j.JMeter: Available Processors =4
2017-12-01 20:37:58,488 INFO o.a.j.JMeter: Default Locale=中文 (中国)
2017-12-01 20:37:58,488 INFO o.a.j.JMeter: JMeter  Locale=英文
2017-12-01 20:37:58,489 INFO o.a.j.JMeter: JMeterHome=D:\apache-jmeter-3.3
2017-12-01 20:37:58,489 INFO o.a.j.JMeter: user.dir  =D:\Users\fanp\PycharmProjects\pyrequest\auto
2017-12-01 20:37:58,489 INFO o.a.j.JMeter: PWD       =D:\Users\fanp\PycharmProjects\pyrequest\auto
2017-12-01 20:37:58,490 INFO o.a.j.JMeter: IP: 10.33.20.28 Name: DST64848 FullName: DST64848.cn1.global.ctrip.com
2017-12-01 20:37:58,490 INFO o.a.j.JMeter: plugin_dependency_paths=../dependencies/lib;../lib;/lib
2017-12-01 20:37:58,490 WARN o.a.j.JMeter: Can't read ../dependencies/lib
2017-12-01 20:37:58,490 WARN o.a.j.JMeter: Can't read ../lib
2017-12-01 20:37:58,490 WARN o.a.j.JMeter: Can't read /lib
2017-12-01 20:37:58,492 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'D:\Users\fanp\PycharmProjects\pyrequest\auto\PerformanceTest\result\report_1201-203756'
2017-12-01 20:37:58,494 INFO o.a.j.s.FileServer: Default base='D:\Users\fanp\PycharmProjects\pyrequest\auto'
2017-12-01 20:37:58,494 INFO o.a.j.s.FileServer: Set new base='D:\Users\fanp\PycharmProjects\pyrequest\auto\PerformanceTest\script'
2017-12-01 20:37:58,645 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2017-12-01 20:37:58,664 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2017-12-01 20:37:58,668 INFO o.a.j.s.SaveService: Using SaveService properties version 3.2
2017-12-01 20:37:58,673 INFO o.a.j.s.SaveService: Loading file: D:\Users\fanp\PycharmProjects\pyrequest\auto\PerformanceTest\script\5U_1201-203756.jmx
2017-12-01 20:37:58,710 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2017-12-01 20:37:58,710 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2017-12-01 20:37:58,711 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2017-12-01 20:37:58,711 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2017-12-01 20:37:58,711 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2017-12-01 20:37:58,711 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2017-12-01 20:37:58,758 INFO o.a.j.e.KeyToolUtils: Exception checking for keytool existence, will return false, try another way.
2017-12-01 20:37:58,979 INFO o.a.j.e.KeyToolUtils: keytool found at 'C:\Program Files\Java\jre1.8.0_121\bin\keytool'
2017-12-01 20:37:58,980 INFO o.a.j.p.h.p.ProxyControl: HTTP(S) Test Script Recorder SSL Proxy will use keys that support embedded 3rd party resources in file D:\apache-jmeter-3.3\bin\proxyserver.jks
2017-12-01 20:37:58,988 INFO o.a.j.JMeter: Creating summariser <summary>
2017-12-01 20:37:58,992 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2017-12-01 20:37:58,992 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: D:\Users\fanp\PycharmProjects\pyrequest\auto\PerformanceTest/result/1201-203756.csv
2017-12-01 20:37:58,992 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: D:\apache-jmeter-3.3\bin\reportgenerator.properties
2017-12-01 20:37:58,993 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2017-12-01 20:37:58,998 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2017-12-01 20:37:59,000 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2017-12-01 20:37:59,000 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2017-12-01 20:37:59,000 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2017-12-01 20:37:59,000 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2017-12-01 20:37:59,000 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2017-12-01 20:37:59,000 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2017-12-01 20:37:59,000 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2017-12-01 20:37:59,001 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2017-12-01 20:37:59,005 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2017-12-01 20:37:59,005 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2017-12-01 20:37:59,005 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2017-12-01 20:37:59,006 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2017-12-01 20:37:59,006 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2017-12-01 20:37:59,006 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2017-12-01 20:37:59,006 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2017-12-01 20:37:59,006 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2017-12-01 20:37:59,006 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2017-12-01 20:37:59,007 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2017-12-01 20:37:59,007 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2017-12-01 20:37:59,008 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2017-12-01 20:37:59,011 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2017-12-01 20:37:59,012 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2017-12-01 20:37:59,012 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2017-12-01 20:37:59,015 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2017-12-01 20:37:59,016 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2017-12-01 20:37:59,323 INFO o.a.j.JMeter: Running test (1512131879323)
2017-12-01 20:37:59,350 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2017-12-01 20:37:59,351 INFO o.a.j.e.StandardJMeterEngine: Starting 0 threads for group Thread Group.
2017-12-01 20:37:59,351 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2017-12-01 20:37:59,351 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=0 ramp-up=1 perThread=Infinity delayedStart=false
2017-12-01 20:37:59,351 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2017-12-01 20:37:59,351 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2017-12-01 20:37:59,351 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2017-12-01 20:37:59,356 INFO o.a.j.r.Summariser: summary =      0 in 00:00:00 = ******/s Avg:     0 Min: 9223372036854775807 Max: -9223372036854775808 Err:     0 (0.00%)
2017-12-01 20:37:59,356 INFO o.a.j.JMeter: Generating Dashboard
2017-12-01 20:37:59,356 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2017-12-01 20:37:59,365 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2017-12-01 20:37:59,451 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2017-12-01 20:37:59,452 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2017-12-01 20:37:59,452 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2017-12-01 20:37:59,453 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2017-12-01 20:37:59,453 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2017-12-01 20:37:59,453 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2017-12-01 20:37:59,453 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2017-12-01 20:37:59,453 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2017-12-01 20:37:59,464 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2017-12-01 20:37:59,464 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2017-12-01 20:37:59,464 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2017-12-01 20:37:59,464 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2017-12-01 20:37:59,468 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 0 samples
2017-12-01 20:37:59,469 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 0 samples
2017-12-01 20:37:59,470 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 0 samples produced in 84ms on channel 0
2017-12-01 20:37:59,470 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2017-12-01 20:37:59,472 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: D:\Users\fanp\PycharmProjects\pyrequest\auto\PerformanceTest\result\report_1201-203756
2017-12-01 20:37:59,529 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: D:\Users\fanp\PycharmProjects\pyrequest\auto\PerformanceTest\result\report_1201-203756, creating folder structure
2017-12-01 20:38:03,811 INFO o.a.j.JMeter: Dashboard generated